import type { FAQSPageType, FAQSType } from '../content/content';

export const FAQPage: FAQSPageType = {
    title: "PDFEquips FAQ",
    description: "यहां आपको हमारे टूल्स और सेवाओं के बारे में सामान्य प्रश्नों के उत्तर मिलेंगे, जैसे कि PDF को जोड़ना, संपादन करना, और फॉर्मेट बदलना। PDFEquips का अधिकतम लाभ उठाने के लिए नीचे दी गई FAQ को देखें!"
};

export const FAQS: FAQSType = [
    {
        question: 'PDFEquips क्या है और यह कैसे काम करता है?',
        answer: 'PDFEquips एक वेब-आधारित प्लेटफ़ॉर्म है जो आपको PDF फ़ाइलों पर विभिन्न कार्य करने की सुविधा देता है, जैसे कि कन्वर्ज़न, मर्ज़ करना, विभाजित करना, आदि। यह आपको अपनी फ़ाइलें अपलोड करने, इच्छित ऑपरेशन का चयन करने और फिर प्रोसेस की गई फ़ाइल डाउनलोड करने की अनुमति देता है।'
    },
    {
        question: 'क्या PDFEquips का उपयोग मुफ्त में किया जा सकता है?',
        answer: 'हाँ, PDFEquips का उपयोग मुफ्त में किया जा सकता है।'
    },
    {
        question: 'क्या PDFEquips का उपयोग करने के लिए मुझे खाता बनाना होगा?',
        answer: 'नहीं, PDFEquips का उपयोग करने के लिए आपको खाता बनाने की आवश्यकता नहीं है।'
    },
    {
        question: 'क्या मैं किसी भी डिवाइस पर PDFEquips का उपयोग कर सकता हूँ?',
        answer: 'हाँ, आप किसी भी डिवाइस पर, जिसमें एक वेब ब्राउज़र हो, PDFEquips का उपयोग कर सकते हैं।'
    },
    {
        question: 'क्या PDFEquips का उपयोग करना सुरक्षित है?',
        answer: 'हाँ, PDFEquips का उपयोग करना सुरक्षित है। आपकी फ़ाइलें एन्क्रिप्ट की जाती हैं और प्रोसेसिंग के बाद तुरंत हटा दी जाती हैं।'
    },
    {
        question: 'मैं अपने pdfequips.com सदस्यता को कैसे रद्द कर सकता हूँ?',
        answer: 'आप किसी भी समय अपनी सदस्यता को रद्द कर सकते हैं।'
    },
    {
        question: 'मैं अपना लॉगिन ईमेल या पासवर्ड कैसे बदल सकता हूँ?',
        answer: 'अपने /manage-account पृष्ठ पर जाएँ, अपना पासवर्ड सत्यापित करें, और फिर अपना ईमेल या पासवर्ड बदलें।'
    },
    {
        question: 'PDFEquips का उपयोग करके मैं फ़ाइल को PDF प्रारूप में कैसे बदल सकता हूँ?',
        answer: 'कन्वर्ट टूल का चयन करें, वह फ़ाइल चुनें जिसे आप कन्वर्ट करना चाहते हैं, और फिर कन्वर्ट बटन पर क्लिक करें।'
    },
    {
        question: 'क्या मैं एक फ़ाइल में कई PDFs को मर्ज़ कर सकता हूँ?',
        answer: 'हाँ, आप organize > merge टूल का उपयोग करके कई PDF फ़ाइलों को एक फ़ाइल में जोड़ सकते हैं।'
    },
    {
        question: 'मैं एक PDF को अलग-अलग पृष्ठों में कैसे विभाजित कर सकता हूँ?',
        answer: 'आप split-by-range या extract-pages टूल का उपयोग करके एक PDF फ़ाइल को अलग-अलग पृष्ठों में विभाजित कर सकते हैं।'
    },
    {
        question: 'क्या मैं अवांछित हिस्सों को हटाने के लिए एक PDF को क्रॉप कर सकता हूँ?',
        answer: 'हाँ, आप क्रॉप टूल का उपयोग करके एक PDF फ़ाइल के अवांछित हिस्सों को हटा सकते हैं।'
    },
    {
        question: 'PDF में कन्वर्ज़न के लिए कौन-कौन से फ़ाइल प्रकार समर्थित हैं?',
        answer: 'PDFEquips PDF में कन्वर्ज़न के लिए विभिन्न प्रकार के फ़ाइल प्रकारों का समर्थन करता है, जिसमें इमेज फ़ाइलें (JPG, PNG, BMP, TIFF, GIF, SVG, WebP, HEIF), .doc, .docx, .ppt, .pptx, .xlsx, .xls, .epub, .rtf, .rtfd, .txt, .md, .html, .psd, .csv, .pdf और बहुत कुछ शामिल हैं।'
    },
    {
        question: 'क्या अपलोड की जाने वाली फ़ाइलों पर कोई आकार सीमा है?',
        answer: 'हाँ, फ़ाइल आकार सीमा 100MB है। यदि आपकी फ़ाइल सीमा से अधिक है, तो आप सीमा बढ़ाने के लिए हमारे प्रीमियम प्लान की सदस्यता ले सकते हैं।'
    },
    {
        question: 'क्या मैं PDF फ़ाइलों को वापस अन्य फ़ॉर्मेट में, जैसे कि Word या Excel में, बदल सकता हूँ?',
        answer: 'हाँ, PDFEquips PDF फ़ाइलों को अन्य विभिन्न फ़ॉर्मेट में बदलने का समर्थन करता है, जिसमें .doc, .docx, .xls, और .xlsx शामिल हैं।'
    },
    {
        question: 'PDFEquips मेरे अपलोड की गई फ़ाइलों की सुरक्षा कैसे सुनिश्चित करता है?',
        answer: 'PDFEquips आपकी अपलोड की गई फ़ाइलों की सुरक्षा के लिए TLS एन्क्रिप्शन का उपयोग करता है। आपकी फ़ाइलें प्रोसेसिंग के तुरंत बाद हटा दी जाती हैं और हमारे सर्वर पर संग्रहीत नहीं होती हैं।'
    },
    {
        question: 'क्या कोई और मेरे अपलोड की गई फ़ाइलों तक पहुँच सकता है?',
        answer: 'नहीं, आपकी अपलोड की गई फ़ाइलें पूरी तरह से निजी और सुरक्षित हैं। केवल आप ही उन्हें देख सकते हैं।'
    },
    {
        question: 'क्या मैं PDF फ़ाइल में पृष्ठों को पुनः व्यवस्थित कर सकता हूँ?',
        answer: 'हाँ, आप PDF फ़ाइल में पृष्ठों को पुनः व्यवस्थित करने के लिए organize टूल्स का उपयोग कर सकते हैं।'
    },
    {
        question: 'क्या मैं PDF से विशेष पृष्ठों को निकाल सकता हूँ?',
        answer: 'हाँ, आप extract-pages टूल का उपयोग करके PDF फ़ाइल से विशेष पृष्ठों को निकाल सकते हैं।'
    },
    {
        question: 'क्या मैं अपनी PDF फ़ाइल की सुरक्षा के लिए पासवर्ड जोड़ सकता हूँ?',
        answer: 'हाँ, आप अपनी PDF फ़ाइल में पासवर्ड जोड़ने के लिए पासवर्ड सुरक्षा टूल का उपयोग कर सकते हैं।'
    },
    {
        question: 'मैं पासवर्ड-संरक्षित PDF को कैसे अनलॉक कर सकता हूँ?',
        answer: 'पासवर्ड-संरक्षित PDF को अनलॉक करने के लिए, बस फ़ाइल का चयन करें, पासवर्ड दर्ज करें, और फ़ाइल अनलॉक हो जाएगी।'
    }
];
