import type { FAQSPageType, FAQSType } from '../content/content';

export const FAQPage: FAQSPageType = {
    title: "أسئلة متكررة عن PDFEquips",
    description: "هنا ستجد إجابات عن الأسئلة الشائعة حول أدواتنا وخدماتنا، من دمج وتحرير ملفات PDF إلى تحويل الصيغ. استعرض الأسئلة المتكررة أدناه للحصول على أقصى استفادة من PDFEquips!"
};

export const FAQS: FAQSType = [
    {
        question: 'ما هو PDFEquips وكيف يعمل؟',
        answer: 'PDFEquips هي منصة عبر الإنترنت تسمح لك بإجراء عمليات متنوعة على ملفات PDF، مثل التحويل، الدمج، التقسيم، وغيرها. يمكنك تحميل ملفاتك، اختيار العملية المطلوبة، ومن ثم تنزيل الملف المعالج.'
    },
    {
        question: 'هل PDFEquips مجاني للاستخدام؟',
        answer: 'نعم، PDFEquips مجاني للاستخدام.'
    },
    {
        question: 'هل أحتاج إلى إنشاء حساب لاستخدام PDFEquips؟',
        answer: 'لا، ليس من الضروري إنشاء حساب لاستخدام PDFEquips.'
    },
    {
        question: 'هل يمكنني استخدام PDFEquips على أي جهاز؟',
        answer: 'نعم، يمكنك استخدام PDFEquips على أي جهاز يحتوي على متصفح ويب.'
    },
    {
        question: 'هل PDFEquips آمن للاستخدام؟',
        answer: 'نعم، PDFEquips آمن للاستخدام. يتم تشفير ملفاتك وحذفها فورًا بعد المعالجة.'
    },
    {
        question: 'كيف يمكنني إلغاء اشتراكي في pdfequips.com؟',
        answer: 'يمكنك إلغاء اشتراكك في أي وقت.'
    },
    {
        question: 'كيف يمكنني تغيير بريدي الإلكتروني أو كلمة المرور الخاصة بي؟',
        answer: 'اذهب إلى صفحة /manage-account، وقم بالتحقق من كلمة المرور، ثم قم بتغيير البريد الإلكتروني أو كلمة المرور.'
    },
    {
        question: 'كيف يمكنني تحويل ملف إلى صيغة PDF باستخدام PDFEquips؟',
        answer: 'اختر أداة التحويل، اختر الملف الذي تريد تحويله، ثم انقر على زر التحويل.'
    },
    {
        question: 'هل يمكنني دمج عدة ملفات PDF في ملف واحد؟',
        answer: 'نعم، يمكنك استخدام أداة الترتيب > الدمج لجمع عدة ملفات PDF في ملف واحد.'
    },
    {
        question: 'كيف يمكنني تقسيم ملف PDF إلى صفحات منفصلة؟',
        answer: 'يمكنك استخدام أداة التقسيم حسب النطاق أو استخراج الصفحات لتقسيم ملف PDF إلى صفحات فردية.'
    },
    {
        question: 'هل من الممكن قص ملف PDF لإزالة أجزاء غير مرغوب فيها؟',
        answer: 'نعم، يمكنك استخدام أداة القص لإزالة الأجزاء غير المرغوب فيها من ملف PDF.'
    },
    {
        question: 'ما هي أنواع الملفات المدعومة للتحويل إلى PDF؟',
        answer: 'PDFEquips يدعم مجموعة واسعة من أنواع الملفات للتحويل إلى PDF، بما في ذلك ملفات الصور (JPG، PNG، BMP، TIFF، GIF، SVG، WebP، HEIF)، .doc، .docx، .ppt، .pptx، .xlsx، .xls، .epub، .rtf، .rtfd، .txt، .md، .html، .psd، .csv، .pdf، وأكثر من ذلك بكثير.'
    },
    {
        question: 'هل هناك حد لحجم الملفات التي يمكنني تحميلها؟',
        answer: 'نعم، الحد الأقصى لحجم الملف هو 100 ميجابايت. إذا تجاوز حجم الملف هذا الحد، يمكنك الاشتراك في الخطة المميزة لزيادة الحد.'
    },
    {
        question: 'هل يمكنني تحويل ملفات PDF مرة أخرى إلى صيغ أخرى مثل Word أو Excel؟',
        answer: 'نعم، يدعم PDFEquips تحويل ملفات PDF إلى مجموعة من الصيغ الأخرى، بما في ذلك .doc، .docx، .xls، و .xlsx.'
    },
    {
        question: 'كيف يضمن PDFEquips أمان الملفات التي أرفعها؟',
        answer: 'يستخدم PDFEquips تشفير TLS لحماية أمان الملفات المرفوعة. كما يتم حذف ملفاتك فورًا بعد المعالجة ولا يتم تخزينها على خوادمنا.'
    },
    {
        question: 'هل يمكن لأي شخص آخر الوصول إلى الملفات التي أرفعها؟',
        answer: 'لا، ملفاتك المرفوعة خاصة وآمنة تمامًا. فقط يمكنك الوصول إليها.'
    },
    {
        question: 'هل يمكنني إعادة ترتيب الصفحات في ملف PDF باستخدام PDFEquips؟',
        answer: 'نعم، يمكنك استخدام أدوات الترتيب لإعادة ترتيب الصفحات في ملف PDF.'
    },
    {
        question: 'هل من الممكن استخراج صفحات معينة من ملف PDF؟',
        answer: 'نعم، يمكنك استخدام أداة استخراج الصفحات لاستخراج صفحات معينة من ملف PDF.'
    },
    {
        question: 'هل يمكنني إضافة كلمة مرور لحماية ملف PDF الخاص بي؟',
        answer: 'نعم، يمكنك استخدام أداة حماية بكلمة مرور لإضافة كلمة مرور لملف PDF الخاص بك.'
    },
    {
        question: 'كيف يمكنني فتح ملف PDF محمي بكلمة مرور؟',
        answer: 'لفتح ملف PDF محمي بكلمة مرور، حدد الملف، وأدخل كلمة المرور، وسيتم فتح الملف.'
    }
];
